var works = {
    a00:'Сколько пальцев у обыкновенной курицы?\n',
    a0: 4,
    a1: '1 - 2 пальца\n',
    a2: '2 - 3 пальца\n',
    a3: '3 - 4 пальца\n',
    a4: '4 - 5 пальцев\n',
    b00: 'К какому семейству относятся косатки?\n',
    b0: 4,
    b1: '1 - Акул\n',
    b2: '2 - Дельфиновых\n',
    b3: '3 - Скатов\n',
    b4: '4 - Китов\n',
    c00: 'Что из килограмма ваты и свинца тяжелее\n',
    c0: 4,
    c1: '1 - Вата\n',
    c2: '2 - Свинец\n',
    c3: '3 - Разницы нет\n',
    c4: '4 - Измерительная чаша\n'
};

